In [3]:
import numpy as np
import pandas as pd

In [5]:
s1 = pd.Series([1,2,3], index = ["A","B","C"])
s1

A    1
B    2
C    3
dtype: int64

In [19]:
s2 = pd.Series((np.arange(5,1,-1)),index = list("love"))
s2

l    5
o    4
v    3
e    2
dtype: int64

In [23]:
s3 = s2.sort_values()
s3

e    2
v    3
o    4
l    5
dtype: int64

Lecture 12 Example 1 : Create a pandas series containing the numbers from 1 to 26 indexed by the letters ‘a’ through ‘z’. Then print out the third number and the number indexed by ‘q’.

In [48]:
import string
pd1 = pd.Series(np.arange(1,27,1),index = list(string.ascii_lowercase))
pd1

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
k    11
l    12
m    13
n    14
o    15
p    16
q    17
r    18
s    19
t    20
u    21
v    22
w    23
x    24
y    25
z    26
dtype: int64

In [40]:
pd1.iloc[3]

4

In [44]:
pd1.loc["q"]

17

In [50]:
pd1.loc["Q"] = 99
pd1

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
k    11
l    12
m    13
n    14
o    15
p    16
q    17
r    18
s    19
t    20
u    21
v    22
w    23
x    24
y    25
z    26
Q    99
dtype: int64

Lecture 12 Example 2 : Create a pandas series,s_gt, containing 7 values evenly distributed from 1.0 to 2.0 including the endpoints indexed by the letters of “jackets”. Then add the value .5 (with index “G”) and the value .75 (with index “T”) to the series.

In [57]:
s_gt = pd.Series(np.linspace(1,2,7),index = list("jackets"))
s_gt

j    1.000000
a    1.166667
c    1.333333
k    1.500000
e    1.666667
t    1.833333
s    2.000000
dtype: float64

In [61]:
s_gt.loc["G"] = 0.5
s_gt.loc["T"] = 0.75
s_gt

j    1.000000
a    1.166667
c    1.333333
k    1.500000
e    1.666667
t    1.833333
s    2.000000
G    0.500000
T    0.750000
dtype: float64

In [87]:
s4 = pd.Series(np.linspace(1,2,7),index = list("jackets"))
s4 += 3 
s4

j    4.000000
a    4.166667
c    4.333333
k    4.500000
e    4.666667
t    4.833333
s    5.000000
dtype: float64

In [89]:
s4 = s4 + s4
s4

j     8.000000
a     8.333333
c     8.666667
k     9.000000
e     9.333333
t     9.666667
s    10.000000
dtype: float64

Write one line of code to produce each of the following:

A pandas series, s1, containing 4 numbers in the range from 1.0 to 2.5 (inclusive) in steps of .5 indexed by “a”,”b”,”c”,”d” - hint: use np.arange


A pandas series, s2, containing only the first two elements of s1

A changed s1 with a 1.0 added to the last element only (becoming 3.5)

A changed s1 with an additional item at the end with value .5 indexed by “e”

A changed s1 with all elements sorted by numeric value (ascending).

In [108]:
s1 = pd.Series(np.arange(1.0,3.0,0.5),index = list("abcd"))
s2 = s1.head(2)
s1.loc["d"] += 1.0
s1.loc["e"] = 0.5
s1.sort_values()

e    0.5
a    1.0
b    1.5
c    2.0
d    3.5
dtype: float64

In [113]:
df1 = pd.DataFrame(np.ones((3,4)), index=list('ABC'), columns=list('efgh'))
df1

     e    f    g    h
A  1.0  1.0  1.0  1.0
B  1.0  1.0  1.0  1.0
C  1.0  1.0  1.0  1.0

In [125]:
df = pd.read_csv("countries.csv", delimiter = ",", index_col = 0)
df

,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
Country,,,,,,,,,,,,,,,,,,,
Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
American Samoa,OCEANIA,57794,199,"290,4","58,29","-20,71","9,27",8000.0,"97,0","259,5",10,15,75,2,"22,46","3,27",NaN,NaN,NaN
Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Wallis And Futuna,OCEANIA,16025,274,"58,5","47,08",NaN,NaN,3700.0,"50,0","118,6",5,25,70,2,NaN,NaN,NaN,NaN,NaN
Western Sahara,NORTHERN AFRICA,273008,266000,"1,0","0,42",NaN,NaN,NaN,NaN,NaN,"0,02",0,"99,98",1,NaN,NaN,NaN,NaN,"0,4"
Yemen,NEAR EAST,21456188,527970,"40,6","0,36",0,"61,5",800.0,"50,2","37,2","2,78","0,24","96,98",1,"42,89","8,3","0,135","0,472","0,393"
Zambia,SUB-SAHARAN AFRICA,11502010,752614,"15,3","0,00",0,"88,29",800.0,"80,6","8,2","7,08","0,03","92,9",2,41,"19,93","0,22","0,29","0,489"
Zimbabwe,SUB-SAHARAN AFRICA,12236805,390580,"31,3","0,00",0,"67,69",1900.0,"90,7","26,8","8,32","0,34","91,34",2,"28,01","21,84","0,179","0,243","0,579"

Lecture 12 Example 3 : Create the Pandas dataframe, pdnums (shown below), created from this nested list: [[1,2],[3,4],[5,6]].

In [136]:
pdnums = pd.DataFrame([[1,2],[3,4],[5,6]],index = ['A','B','C'], columns = ['1','2'])
pdnums

   1  2
A  1  2
B  3  4
C  5  6

   hi
0   0
1   2
2   4
3   6
4   8